# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input(" Введите порядковый номер буквы: "))
number = chr(a + 96)
print(number)

# https://drive.google.com/file/d/1NnsU2yayMMyV9tT6rPJSF-VDbHG7zPLG/view?usp=sharing